Hi @hacker65536, I'm testing the PR and all seems to be well with the inline policy, however it's still mentioning the forced replacements as with the current version of the module. Is the same showing on your end? This is what I'm getting after adding an additional group: 
```hcl
# module.aws-iam-identity-center.aws_identitystore_group_membership.sso_group_membership["testuser1_AWSControlTowerAdmins"] must be replaced
-/+ resource "aws_identitystore_group_membership" "sso_group_membership" {
      ~ group_id          = "xx" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "xx/xx" -> (known after apply)
      ~ membership_id     = "xx" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.aws-iam-identity-center.aws_identitystore_group_membership.sso_group_membership["testuser1_SectionSre"] must be replaced
-/+ resource "aws_identitystore_group_membership" "sso_group_membership" {
      ~ group_id          = "xx" # forces replacement -> (known after apply) # forces replacement
      ~ id                = "xx" -> (known after apply)
      ~ membership_id     = "xx" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```